fonecmid-diplom/src/Catalogs/ВКМ_УведомленияТелеграмБоту/ВКМ_УведомленияТелеграмБоту.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВКМ_УведомленияТелеграмБоту</name>
  <attributes>
    <name>ТекстСообщения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/CommonModules/ВКМ_Телеграм/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ОтправитьСообщениеВТелеграм(СтрокаJSON) экспорт 
	// Код для отправки данных в телеграм (ВКМ_диплом)
	УстановитьПривилегированныйРежим(Истина);
	// Создаем новое соединение 
	ТелоОтвета = СтрокаJSON;
	Если ТелоОтвета <> "[]" Тогда

	Сервер = "api.telegram.org"; 
	Соединение  =  Новый HTTPСоединение(Сервер,443,,,,5,Новый ЗащищенноеСоединениеOpenSSL());
	ID = "-5275799156";
	Токен = "8586652787:AAHkDsQkX2Ch4rgL6ATKq2mBRItz3FtxR3k";
	Ресурс = "bot" + Токен + "/SendMessage?chat_id=" + ID + "&text=" + ТелоОтвета; 
		 
	Заголовки = Новый Соответствие();	
	Заголовки.Вставить("Content-type","application/json");
	
	HTTPЗапрос = Новый HTTPЗапрос(Ресурс,Заголовки); 
	Попытка
		ОтветHTTP = Соединение.Получить(HTTPЗапрос);
		Соединен = Истина;
	Исключение
		Соединен = Ложь;
	КонецПопытки;
	
	Сообщить("Соединение - " + Соединен);

	//HTTPЗапрос.УстановитьИмяФайлаТела(ФайлТелаЗапроса);
	
	HTTPОтвет = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
	Если HTTPОтвет.КодСостояния =  200 Тогда
		
		 УдалитьСообщенияИз1С();     // https://xn----1-bedvffifm4g.xn--p1ai/articles/2017-09-07-exchange-with-internet-services/
	
	Иначе		
		Данные = HTTPОтвет.ПолучитьТелоКакСтроку();
		ЗаписьЖурналаРегистрации ("ОбменСТелеграм", УровеньЖурналаРегистрации.Ошибка,,, 
		ОбработкаОшибок. ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())); 	
	КонецЕсли;  
Иначе
	Отказ = Истина;
КонецЕсли;
 // Конец кода для отправки данных в телеграм (ВКМ_диплом)
		
КонецПроцедуры 



#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ВКМ_ИнтеграцияСТелеграмБот() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_УведомленияТелеграмБоту.Ссылка КАК Ссылка,
		|	ВКМ_УведомленияТелеграмБоту.ТекстСообщения КАК ТекстСообщения,
		|	ВКМ_УведомленияТелеграмБоту.Отправлен КАК Отправлен
		|ИЗ
		|	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту";
	
		
	РезультатЗапроса = Запрос.Выполнить();
	ТЗ =  РезультатЗапроса.Выгрузить();  
	Текст = ТЗ.ВыгрузитьКолонку("ТекстСообщения");
	СтрокаJSON = ЗаписатьЗначениеJSON(Текст);
	ОтправитьСообщениеВТелеграм(СтрокаJSON); 
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		Объект  = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		Объект.Отправлен  = Истина; 
		Объект.Записать();
	КонецЦикла;		 
КонецФункции

#КонецОбласти


#Область СлужебныеПроцедурыИФункции
Процедура УдалитьСообщенияИз1С()
       	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_УведомленияТелеграмБоту.Ссылка КАК Ссылка,
		|	ВКМ_УведомленияТелеграмБоту.Отправлен КАК Отправлен
		|ИЗ
		|	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту
		|ГДЕ
		|	ВКМ_УведомленияТелеграмБоту.Отправлен = &Истина";
	
	Запрос.УстановитьПараметр("Истина", Истина);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТЗ = РезультатЗапроса.Выгрузить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  
		
		 Объект  = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		 Объект.Удалить();
		 
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
